[
    {
        "phrase": "رَبَّنَا! اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَاعْفُ عَنِّي.",
        "meaning": "Our Lord! Forgive me for what I have done and what I have delayed, and pardon me."
    },
    {
        "phrase": "رَبَّنَا! أَعُوذُ بِكَ مِنْ كُلِّ ذَنْبٍ تَكَرَّرَ، وَأَسْتَغْفِرُكَ مِنْ كُلِّ عَمَلٍ سَيِّئٍ.",
        "meaning": "Our Lord! I seek refuge with You from every recurring sin, and I ask Your forgiveness for every bad deed."
    },
    {
        "phrase": "أَسْتَغْفِرُ اللَّـهَ الَّذِي لَا إِلَـٰهَ إِلَّا هُوَ، وَأَعْتَذِرُ إِلَيْكَ إِذَا أَذَيْتُكَ.",
        "meaning": "I seek forgiveness from Allah, who there is no deity but Him, and I apologize to You if I have harmed you."
    },
    {
        "phrase": "رَبَّنَا! نَجِّنِي مِنَ الشُّحِّ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنَ الطَّعْنِ فِي النَّاسِ.",
        "meaning": "Our Lord! Save me from stinginess and greed, and I seek refuge with You from backbiting others."
    },
    {
        "phrase": "رَبَّنَا! اجْعَلْنِي مِنَ الَّذِينَ يُحِبُّونَ الْمَغْفِرَةَ، وَاحْمِني مِنْ غِيبَةِ الْمُسْلِمِينَ.",
        "meaning": "Our Lord! Make me among those who love forgiveness, and protect me from backbiting Muslims."
    },
    {
        "phrase": "رَبَّنَا! اجْعَلْ لِي قَلْبًا طَاهِرًا، وَاغْفِرْ لِي مَا فَعَلْتُ مِنَ الْخَطَايَا.",
        "meaning": "Our Lord! Grant me a pure heart, and forgive me for the sins I have committed."
    },
    {
        "phrase": "رَبَّنَا! اجْعَلْنِي مِنَ التَّائِبِينَ، وَارْحَمْنِي وَاغْفِرْ لِي.",
        "meaning": "Our Lord! Make me among those who repent, and have mercy on me and forgive me."
    },
    {
        "phrase": "رَبَّنَا! لَا تَجْعَلْنِي مِنَ الْمُعَذَّبِينَ، وَاغْفِرْ لِي أَخْطَائِي.",
        "meaning": "Our Lord! Do not make me among the punished, and forgive me my mistakes."
    },
    {
        "phrase": "رَبَّنَا! أَعُوذُ بِكَ مِنْ كُلِّ سُوءٍ، وَأَسْتَغْفِرُكَ لِذَنْبِي.",
        "meaning": "Our Lord! I seek refuge with You from all evil, and I seek Your forgiveness for my sin."
    },
    {
        "phrase": "رَبَّنَا! نَجِّنِي مِنَ الظُّلْمِ وَالظُّلْمَةِ، وَاغْفِرْ لِي ذُنُوبِي.",
        "meaning": "Our Lord! Save me from oppression and darkness, and forgive me my sins."
    },
    {
        "phrase": "آسِفٌ لِأَنِّي نَسِيتُ أَنْ أُعْطِيَكَ أُجْرَةَ السَّيَّارَةِ.",
        "meaning": "I’m sorry for forgetting to give you the fare."
    },
    {
        "phrase": "أَعْتَذِرُ لَكَ لِأَنِّي نَسِيتُ أَنْ أَفْعَلَ مَا طَلَبْتَهُ.",
        "meaning": "I apologize for forgetting to do what you asked."
    },
    {
        "phrase": "آسِفٌ لِكَسْرِ الزُّجَاجَةِ، كَانَ ذَلِكَ غَيْرَ قَصْدِي.",
        "meaning": "I’m sorry for breaking the glass; that was unintentional."
    },
    {
        "phrase": "أَشْعُرُ بِالذَّنْبِ لِأَنَّنِي نَسِيتُ أَنْ أُعِدَّ الْوَاجِبَاتِ.",
        "meaning": "I feel guilty for forgetting to do my homework."
    },
    {
        "phrase": "آسِفٌ لِأَنَّ كَلَامِي كَانَ غِيبَةً.",
        "meaning": "I’m sorry for speaking ill of you."
    },
    {
        "phrase": "أَعْتَذِرُ إِلَيْكَ لِأَنَّنِي آذَيْتُكَ، وَأَرْجُو أَنْ تَغْفِرَ لِي.",
        "meaning": "I apologize to you for hurting you, and I hope you can forgive me."
    },
    {
        "phrase": "أَعْتَذِرُ لَكَ لِأَنَّ كَلَامِي قَدْ أَسَاءَ إِلَيْكَ.",
        "meaning": "I apologize if my words offended you."
    },
    {
        "phrase": "أَشْعُرُ بِالْحُزْنِ لِأَنَّنِي كُنْتُ غَاضِبًا.",
        "meaning": "I feel sad for being angry."
    },
    {
        "phrase": "أَعْتَذِرُ إِذَا كَانَتْ أَفْعَالِي قَدْ أَسَاءَتْ إِلَيْكَ.",
        "meaning": "I apologize if my actions have hurt you."
    },
    {
        "phrase": "أَسْتَغْفِرُ اللَّـهَ لِكُلِّ ذَنْبٍ، لَكِنَّنِي أَعْتَذِرُ لَكَ لِأَنَّنِي أَذَيْتُكَ.",
        "meaning": "I seek forgiveness from Allah for every sin, but I apologize to you for hurting you."
    },
    {
        "phrase": "أَعْتَذِرُ لِأَنَّنِي كُنْتُ مَشْغُولًا وَلَمْ أَحْضُرْ.",
        "meaning": "I apologize for being busy and not attending."
    },
    {
        "phrase": "آسِفٌ لِأَنَّنِي خَذَلْتُكَ، وَأَرْجُو أَنْ تَفْهَمَ.",
        "meaning": "I’m sorry for letting you down, and I hope you understand."
    },
    {
        "phrase": "أَعْتَذِرُ لَكَ لِأَنَّنِي لَمْ أَحْتَرِمْ وَعْدِي.",
        "meaning": "I apologize for not keeping my promise."
    },
    {
        "phrase": "أَشْعُرُ بِالْخَجَلِ لِأَنَّنِي كُنْتُ غَيْرَ مُبَالٍ.",
        "meaning": "I feel ashamed for being indifferent."
    },
    {
        "phrase": "أَعْتَذِرُ لِأَنَّنِي كُنْتُ مَشْغُولًا جِدًّا وَلَمْ أَتَّصِلْ.",
        "meaning": "I apologize for being so busy and not calling."
    },
    {
        "phrase": "أَشْكُرُكَ عَلَى تَفَاهُمِكَ، وَأَعْتَذِرُ لِمَا قَدْ قُلْتُ.",
        "meaning": "I thank you for your understanding, and I apologize for what I said."
    },
    {
        "phrase": "رَبَّنَا! نَجِّنِي مِنْ كُلِّ فِكْرٍ سَيِّـٍٔ وَعَمَلٍ سَيِّـٍٔ، وَاحْفَظْنِي حَتَّى مِنَ الطَّرِيقِ الَّذِي يُؤَدِّي إِلَيْهِ.",
        "meaning": "Our Lord! Save me from every evil thought and deed, and protect me even from the path leading to it."
    }
]