[
    {
        "phrase": "أَحْتَاجُ إِلَى التَّحَدُّثِ عَنْ شَيْءٍ يُزْعِجُنِي.",
        "meaning": "I need to talk about something that bothers me."
    },
    {
        "phrase": "أَفْهَمُ رَأْيَكَ، لَكِنَّ لَدَيَّ وَجْهَةُ نَظَرٍ مُخْتَلِفَةٌ.",
        "meaning": "I understand your opinion, but I have a different perspective."
    },
    {
        "phrase": "يُمْكِنُنَا حَلُّ هَذَا إِذَا تَحَدَّثْنَا بِشَكْلٍ مَفْتُوحٍ.",
        "meaning": "We can resolve this if we talk openly."
    },
    {
        "phrase": "أَشْعُرُ أَنَّنِي لَمْ يُسْتَمَعْ إِلَيَّ.",
        "meaning": "I feel like I'm not being heard."
    },
    {
        "phrase": "هَذَا لَيْسَ كَمَا كُنْتُ أَتَوَقَّعُ.",
        "meaning": "This is not what I expected."
    },
    {
        "phrase": "لِمَاذَا تَصِرُّ عَلَى ذَلِكَ؟",
        "meaning": "Why do you insist on that?"
    },
    {
        "phrase": "أَشْعُرُ بِالْقَلَقِ بَشَأْنِ مَا حَدَثَ.",
        "meaning": "I'm worried about what happened."
    },
    {
        "phrase": "نَحْتَاجُ إِلَى أَنْ نَكُونَ صَادِقِينَ مَعَ بَعْضِنَا الْبَعْضِ.",
        "meaning": "We need to be honest with each other."
    },
    {
        "phrase": "هَلْ يُمْكِنُ أَنْ نَتَحَادَثَ عَنْ هَذَا بَعْدَ ذَلِكَ؟",
        "meaning": "Can we talk about this later?"
    },
    {
        "phrase": "يَجِبُ أَنْ نُحَاوِلَ حَلَّ الْخِلَافَاتِ بِنَاءً عَلَى الاِحْتِرَامِ.",
        "meaning": "We should try to resolve disagreements based on respect."
    },
    {
        "phrase": "لَا أُحِبُّ الطَّرِيقَةَ الَّتِي تَتَحَدَّثُ بِهَا إِلَيَّ.",
        "meaning": "I don't like the way you're speaking to me."
    },
    {
        "phrase": "عَلَيْنَا أَنْ نَتَفَاهَمَ أَكْثَرَ.",
        "meaning": "We need to understand each other more."
    },
    {
        "phrase": "لَا يُمْكِنُ أَنْ نُسَامِحَ بَعْضُنَا مِنْ دُونِ وَضْعِ حُدُودٍ.",
        "meaning": "We can't forgive each other without setting boundaries."
    },
    {
        "phrase": "هَلْ يُمْكِنُ أَنْ نَجِدَ حَلًّا مُشْتَرَكًا؟",
        "meaning": "Can we find a common solution?"
    },
    {
        "phrase": "يَجِبُ أَنْ نُناقِشَ هَذَا فِي وَقْتٍ آخَرَ.",
        "meaning": "We should discuss this at another time."
    },
    {
        "phrase": "مَا دَفَعَكَ لِلْقَوْلِ بِذَلِكَ؟",
        "meaning": "What made you say that?"
    },
    {
        "phrase": "لَا أَظُنُّ أَنَّ هَذَا هُوَ الْحَلُّ الصَّحِيحُ.",
        "meaning": "I don't think this is the right solution."
    },
    {
        "phrase": "يَجِبُ أَنْ تَكُونَ أَكْثَرَ حَذَرًا فِي أَعْمَالِكَ.",
        "meaning": "You need to be more careful in your work."
    },
    {
        "phrase": "لَمْ أَكُنْ رَاضِيًا عَنْ جَوَابِكَ فِي الْمَشْرُوعِ الأَخِيرِ.",
        "meaning": "I wasn't satisfied with your response in the last project."
    },
    {
        "phrase": "أَحْتَاجُ إِلَى رَأْيِكَ أَكْثَرَ، لَكِنَّ ذَلِكَ لَمْ يَكُنْ مَوْضُوعًا كَافِيًا.",
        "meaning": "I need your opinion more, but that wasn't a sufficient topic."
    },
    {
        "phrase": "عَلَيْكَ أَنْ تَعْمَلَ عَلَى تَحْسِينِ تَوَاصُلِكَ مَعَ الْفَرِيقِ.",
        "meaning": "You need to work on improving your communication with the team."
    },
    {
        "phrase": "يَجِبُ أَنْ تَكُونَ أَكْثَرَ قُدْرَةً عَلَى التَّنظِيمِ.",
        "meaning": "You should be more organized."
    },
    {
        "phrase": "لَا يُمْكِنُ تَحَمُّلُ تَأَخُّرِكَ فِي إِنْجَازِ الْمَهَامِّ.",
        "meaning": "We cannot tolerate your delays in completing tasks."
    },
    {
        "phrase": "أَشْعُرُ أَنَّكَ لَمْ تَسْتَغِلَّ الْمَوَادَّ بِالشَّكْلِ اللَّازِمِ.",
        "meaning": "I feel that you didn't utilize the resources properly."
    },
    {
        "phrase": "تَحْتَاجُ إِلَى تَطَوُّرٍ فِي مَهَارَاتِكَ التَّقْنِيَّةِ.",
        "meaning": "You need to improve your technical skills."
    },
    {
        "phrase": "أَنَا مُنْتَظِرٌ لِلرَّدِّ عَلَى مَشَاكِلِكَ السَّابِقَةِ.",
        "meaning": "I am waiting for your response to your previous issues."
    },
    {
        "phrase": "يَجِبُ أَنْ تَكُونَ أَكْثَرَ انْتِبَاهًا لِلتَّفَاصِيلِ.",
        "meaning": "You should pay more attention to details."
    },
    {
        "phrase": "حَاوِلْ أَنْ تَفْهَمَ عَشْرَةَ النَّقَاطِ الَّتِي تَطَلَّبَتْ مِنَّا قِيَامَهَا.",
        "meaning": "Try to understand the ten points we needed you to address."
    },
    {
        "phrase": "لَا تَتَوَقَّعْ أَنْ أَقُومَ بِكُلِّ شَيْءٍ بَدَلًا مِنْكَ.",
        "meaning": "Don't expect me to do everything for you."
    },
    {
        "phrase": "يَجِبُ أَنْ تُحَسِّنَ مِنْ إِدَارَتِكَ لِلْوَقْتِ.",
        "meaning": "You need to improve your time management."
    },
    {
        "phrase": "كَيْفَ يُمْكِنُنَا تَجَاوُزُ هَذِهِ الْمَشَاكِلِ سَوِيًّا؟",
        "meaning": "How can we overcome these problems together?"
    },
    {
        "phrase": "عَلَيْكَ أَنْ تَكُونَ أَكْثَرَ انْخِرَاطًا فِي فَرِيقِكَ.",
        "meaning": "You should be more engaged with your team."
    },
    {
        "phrase": "لَكِنَّكَ تَحْتَاجُ إِلَى بَعْضٍ مِنَ الْمُسَاعَدَةِ لِلِتَّحَسُّنِ.",
        "meaning": "But you need some help to improve."
    },
    {
        "phrase": "هَلْ يُمْكِنُ أَنْ نَجْلِسَ لِنَقْتَحِمَ قَضَايَاكَ؟",
        "meaning": "Can we sit down to address your issues?"
    },
    {
        "phrase": "أَظُنُّ أَنَّهُ يُمْكِنُنَا تَحْسِينُ بَعْضِ النِّقَاطِ مَعًا.",
        "meaning": "I think we can improve some points together."
    }
]