[
    {
        "phrase": "أَنا آسِف، لَقَدْ أَخْطَأتُ.",
        "meaning": "I am sorry, I made a mistake."
    },
    {
        "phrase": "شُكْرًا جَزيلًا لِكُلِّ مَا تَفْعَلُهُ مِنْ أَجْلِي.",
        "meaning": "Thank you very much for everything you do for me."
    },
    {
        "phrase": "أَنا مُمْتَنٌّ لَكَ عَلى دَعْمِكَ.",
        "meaning": "I am grateful to you for your support."
    },
    {
        "phrase": "أَنا أَشْعُرُ بالسَّعادة عِندَ مَعِيَتِكَ.",
        "meaning": "I feel happy when I am with you."
    },
    {
        "phrase": "أَنتَ تَجْعَلُ حَيَاتِي أَجْمَلَ.",
        "meaning": "You make my life more beautiful."
    },
    {
        "phrase": "لا تَفْقِدِي الأَمَلَ، كُلُّ شَيْءٍ سَيَكُونُ بِخَيْرٍ.",
        "meaning": "Don't lose hope; everything will be alright."
    },
    {
        "phrase": "أَنا أَفْهَمُ مَا تَشْعُرُ بِهِ.",
        "meaning": "I understand how you feel."
    },
    {
        "phrase": "أَشْعُرُ بِالْحُزْنِ مِنْ أَجْلِك.",
        "meaning": "I feel sad for you."
    },
    {
        "phrase": "أُحِبُّ طَرِيقَتَكَ فِي تَعَامُلِكَ مَعَ الْحَيَاةِ.",
        "meaning": "I love your way of dealing with life."
    },
    {
        "phrase": "يَجِبُ أَنْ تَفْتَخِرَ بِنَفْسِكَ.",
        "meaning": "You should be proud of yourself."
    },
    {
        "phrase": "أَنا مَعَكَ فِي كُلِّ ظُرُوفِكَ.",
        "meaning": "I am with you in all your circumstances."
    },
    {
        "phrase": "لا تَنْسَ أَنْ تَتَنَفَّسَ عَمِيقًا.",
        "meaning": "Don't forget to take deep breaths."
    },
    {
        "phrase": "كلُّ شَيْءٍ سَيَجُوزُ، أَلَا تَخَافَ.",
        "meaning": "Everything will pass, don't be afraid."
    },
    {
        "phrase": "أَنتَ لَسْتَ وَحِيدًا، نَحنُ مَعَكَ.",
        "meaning": "You are not alone; we are with you."
    },
    {
        "phrase": "مُسَاعَدَتُكَ لِي كانت مُهِمَّةً جِدًّا.",
        "meaning": "Your help to me was very important."
    },
    {
        "phrase": "أَشْعُرُ بِالْفَخْرِ لِأنَّكَ أَخِي.",
        "meaning": "I feel proud to have you as my brother."
    },
    {
        "phrase": "مَا أَجْمَلَ أَنْ نَتَعَاوَنَ سَوِيًّا.",
        "meaning": "How beautiful it is for us to cooperate together."
    },
    {
        "phrase": "أَنا أُؤْمِنُ بك، وَلَدَيْكَ قُدُرَاتٌ رَائِعَةٌ.",
        "meaning": "I believe in you, and you have wonderful abilities."
    },
    {
        "phrase": "مَا أَجْمَلَ اللَّحَظَاتِ الَّتِي نَشْعُرُ فِيهَا بِنَفَحَاتِ الرَّحْمَةِ وَالْمَغْفِرَةِ.",
        "meaning": "How beautiful are the moments in which we feel the breezes of mercy and forgiveness."
    },
    {
        "phrase": "إِنَّ اللَّهَ مَعَ الصَّابِرِينَ، وَمَن تَحَمَّلَ الأَلَمَ لِيُحَقِّقَ حُلْمَهُ سَيَجِدُ الأَنْوَارَ تَتَجَلَّى فِي سَمَائِهِ.",
        "meaning": "Indeed, Allah is with the patient, and whoever endures pain to realize their dream will find the lights manifesting in their sky."
    },
    {
        "phrase": "فِي كُلِّ قَلْبٍ حَكِيمٍ سَتَجِدُ حُزْنًا مُنْتَشِرًا، لَكِنَّ الأَمَلَ يُجَدِّدُ الحَيَاةَ.",
        "meaning": "In every wise heart, you will find a sorrow that lingers, but hope renews life."
    },
    {
        "phrase": "أَشْعُرُ بِأَصْوَاتِ النَّاسِ تَحْمِلُ أَحْزَانَهُم فِي طُرُقٍ تَجْعَلُ الْقَلْبَ يَذُوبُ.",
        "meaning": "I feel the voices of people carrying their sorrows in ways that make the heart melt."
    },
    {
        "phrase": "وَكَمْ أَرَى فِي الأَفْقِ الْبَعيدِ أَحْلَامًا تَتَشَكَّلُ، وَأَسْتَمِعُ لِنَغْمَاتِ الْحَيَاةِ تَغْمُرُنِي.",
        "meaning": "And how many dreams do I see in the distant horizon taking shape, and I listen to the melodies of life enveloping me."
    },
    {
        "phrase": "مَنْ تَجَرَّدَ مِنَ الهموم، أَدْرَكَ حَقِيقَةَ السَّعادةِ.",
        "meaning": "Whoever sheds their worries realizes the truth of happiness."
    },
    {
        "phrase": "تَسْكُنُ قَلْبِي أَلْحَانُ النَّشِيدِ، تَحْمِلُ أَمَلًا وَإِيمَانًا يُجَدِّدُ أَحْلَامِي.",
        "meaning": "The melodies of the nasheed dwell in my heart, carrying hope and faith that renew my dreams."
    },
    {
        "phrase": "مَا أَجْمَلَ عَيْنَيَّ اللَّتَينِ تَبْكِيَانِ، فِي دَموعِهِما مَعَانٍ لا تُحَدُّ.",
        "meaning": "How beautiful are my eyes that cry, in their tears are meanings beyond measure."
    },
    {
        "phrase": "إِنَّ الطُّمَأْنِينَةَ تَجِدُها فِي قَلْبٍ مَلآنٍ بِذِكْرِ اللَّهِ.",
        "meaning": "Indeed, tranquility can be found in a heart filled with the remembrance of Allah."
    },
    {
        "phrase": "كُلَّمَا أَحَسَسْتُ بِالضِّيَاقَةِ، أَجِدُ أَنْفَاسَ الفَرَحِ تَخْفُقُ فِي قَلْبِي.",
        "meaning": "Whenever I feel constricted, I find the breaths of joy fluttering in my heart."
    },
    {
        "phrase": "أُمِّي، أَنْتِ نُورُ قَلْبِي وَدَعْمِي فِي كُلِّ مَسَارٍ.",
        "meaning": "My mother, you are the light of my heart and my support in every path."
    },
    {
        "phrase": "حَبِيبَتِي، أَنتِ جَنَّةُ حَيَاتِي، وَمَشَاعِرُ حُبِّي تَزْهَرُ كَأَحْلَى الْوَرُودِ.",
        "meaning": "My beloved, you are the paradise of my life, and my feelings of love bloom like the most beautiful flowers."
    },
    {
        "phrase": "أَخِي، أَنْتَ سَندِي فِي الحَيَاةِ، وَرَفِيقِي فِي كُلِّ التَّجَارِبِ.",
        "meaning": "My brother, you are my support in life and my companion in every experience."
    },
    {
        "phrase": "صَدِيقِي، مَشَاعِرُ الصَّدَاقَةِ تَجْعَلُ قَلْبِي يَفْرَحُ كَأَنَّمَا أَنَا فِي السَّمَاءِ.",
        "meaning": "My friend, the feelings of friendship make my heart rejoice as if I am in the sky."
    },
    {
        "phrase": "أُسْتَاذِي، أَنتَ مَشْعَلُ الْعِلْمِ الَّذِي يُنَوِّرُ طَرِيقِي.",
        "meaning": "My teacher, you are the torch of knowledge that illuminates my path."
    },
    {
        "phrase": "إلى إخوَانِنا المُعَذَّبين، نَحْمِلُ قَلْبَكُمْ فِي صَدْرِنَا، وَندْعُو لَكُم بِالْفَرَجِ.",
        "meaning": "To our oppressed brothers, we carry your hearts in our chests and pray for your relief."
    },
    {
        "phrase": "إلى الإيغور، إِنَّ صَمْدَكُمْ وَصَبْرَكُمْ يُلْهِمُ العَالَمَ، وَنَحْنُ مَعَكُمْ.",
        "meaning": "To the Uyghurs, your resilience and patience inspire the world, and we are with you."
    },
    {
        "phrase": "أُمِّي، تَضحِيَاتُكِ وَحُبُّكِ هُمَا السَّبَبُ فِي كُلِّ نَجَاحِي.",
        "meaning": "Mother, your sacrifices and love are the reason for all my successes."
    },
    {
        "phrase": "زَوْجَتِي، إِنَّ أَيَّامِي مَزْهَرَةٌ بِحُبِّكِ، وَأَحْلَامِي تَزْهَرُ مَعَكِ.",
        "meaning": "My wife, my days blossom with your love, and my dreams flourish with you."
    },
    {
        "phrase": "أَخِي، مَعَكَ أَشْعُرُ أَنَّ حَيَاتِي أَكْمَلَتْ أَنْفَاسَهَا.",
        "meaning": "My brother, with you, I feel that my life has completed its breaths."
    },
    {
        "phrase": "إلى أصدقائي، مَعَكُمْ أَشْعُرُ أَنَّ أَيَّامِي تَحْمِلُ جَمالَ الحَيَاةِ.",
        "meaning": "To my friends, with you, I feel that my days carry the beauty of life."
    },
    {
        "phrase": "أُسْتَاذِي، مَجْهُودَاتُكَ تَجْعَلُ الْعِلْمَ سَبيلِي لِلنَّجَاحِ.",
        "meaning": "My teacher, your efforts make knowledge my path to success."
    },
    {
        "phrase": "إلى إخوَانِنا المُعَذَّبين، قُلُوبُنَا مَعَكُمْ، فَلا تَفْقِدُوا الأَمَلَ.",
        "meaning": "To our oppressed brothers, our hearts are with you, so do not lose hope."
    },
    {
        "phrase": "إلى الإيغور، تَارِيخُكُمْ كُلُّهُ شَجَاعَةٌ، وَنَحْنُ نُقَفُّ مَعَكُمْ فِي كُلِّ مَعَانَاتِكُمْ.",
        "meaning": "To the Uyghurs, your entire history is one of bravery, and we stand with you in all your struggles."
    },
    {
        "phrase": "لَكِنَّ النَّفْسَ غَيْرُ رَاضِيَةٍ.",
        "meaning": "But, my heart is not well."
    },
    {
        "phrase": "وَأَشْعُرُ أَنَّ ضَعْفِي وَرَحْمَتِي وَتَوَاضُعِي سَيُعَذِّبُونَنِي، كَأَنَّنِي أَرَى ذَٰلِكَ بَوَاضِحَةً أَمَامَ عَيْنَيَّ.",
        "meaning": "My weakness, kindness, and humility will torment me; I see it clearly before my eyes."
    },
    {
        "phrase": "أَشْعُرُ أَنَّ حُبِّي أَحْيَانًا يُشْعِرُنِي بِالثِّقْلِ عَلَى نَفْسِي.",
        "meaning": "Sometimes, my love feels like a burden to me."
    }
]