[
    {
        "phrase": "مَا هِيَ وَصْفَةُ الطَّعَامِ الَّتِي تَشْتَهِيها؟",
        "meaning": "What is the dish you crave?"
    },
    {
        "phrase": "هَلْ جَرَّبْتَ طَبْخَ الْمَعْكُوزَةِ الْمَشْهُورَةِ؟",
        "meaning": "Have you tried cooking the famous Maqlooba?"
    },
    {
        "phrase": "تُعَزِّزُ الحَلَوِيَّاتُ الطَّعْمَ الْلَّذِيذَ لِكُلِّ مُناسَبَةٍ.",
        "meaning": "Sweets enhance the delicious flavor for every occasion."
    },
    {
        "phrase": "مَشْرُوبَاتُ الْعَصِيرِ الطَّازَجِ مُنْعِشَةٌ فِي الْصَيْفِ.",
        "meaning": "Fresh juice drinks are refreshing in the summer."
    },
    {
        "phrase": "مَا أَفْضَلُ طَرِيقَةٍ لِطَبْخِ اللَّحْمِ بِالتَّوَابِلِ؟",
        "meaning": "What is the best way to cook meat with spices?"
    },
    {
        "phrase": "الْمَأْكُولَاتُ التَّقْلِيدِيَّةُ تَحْمِلُ طَعْمَ الْوَطَنِ.",
        "meaning": "Traditional foods carry the taste of the homeland."
    },
    {
        "phrase": "عَلَيْكَ تَجْرِبَةُ الوَصْفَةِ الجَدِيدَةِ لِلْفَتُوشِ.",
        "meaning": "You should try the new recipe for Fattoush."
    },
    {
        "phrase": "مَا هِيَ الوَصْفَةُ السَّرِّيَّةُ لِطَبْخِ الْمَقْلُوبَةِ؟",
        "meaning": "What is the secret recipe for making Maqluba?"
    },
    {
        "phrase": "تَحتاجُ الشَّورْبَةُ إِلَى مَزيدٍ مِنَ التَّوَابِلِ لِتَكونَ لَذِيذَةً.",
        "meaning": "The soup needs more spices to be delicious."
    },
    {
        "phrase": "مَطْبَخُهَا مَلْئٌ بالأَفْكَارِ الإِبْتِكاريةِ لِطَبْخِ الْخُضَرِ.",
        "meaning": "Her kitchen is full of innovative ideas for cooking vegetables."
    },
    {
        "phrase": "مَا هِيَ أَشْهَى الْأَكْلَاتِ الأويغُورِيَّةِ؟",
        "meaning": "What are the most delicious Uyghur dishes?"
    },
    {
        "phrase": "تَجْرِبَةُ طَبْخِ الْبَلُو تَسْتَحِقُّ الْمَشَاهَدَةَ.",
        "meaning": "The experience of cooking Polo is worth watching."
    },
    {
        "phrase": "يُعَدُّ اللَّحْمُ مَعَ الْخُضَرِ أَحَدَ الأَصْنَافِ الشَّهِيَّةِ.",
        "meaning": "Meat with vegetables is considered one of the delicious varieties."
    },
    {
        "phrase": "الْخُبْزُ الأويغُورِيُّ يُحَضَّرُ بِنَكْهَاتٍ مُتَنَوِّعَةٍ.",
        "meaning": "Uyghur bread is prepared with diverse flavors."
    },
    {
        "phrase": "هَلْ قُمْتَ بِتَجْرِبَةِ الْجُوْمَارْ؟",
        "meaning": "Have you tried the Uyghur dumplings (Jumara)?"
    },
    {
        "phrase": "الطَّعْمُ الحَارُّ لِلطَّبَقَاتِ الأويغُورِيَّةِ يُعْبِّرُ عَنْ الثَّقَافَةِ.",
        "meaning": "The spicy flavor of Uyghur dishes expresses the culture."
    },
    {
        "phrase": "تَأْكُلهَا عَائِلَتي كُلَّ يَوْمٍ كَجزءٍ مِنْ تَارِيخِنا.",
        "meaning": "My family eats it every day as part of our history."
    },
    {
        "phrase": "مَا هِيَ أَشْهَى الطَّبَقَاتِ الَّتِي تَحُضَرُ لِلْمُناسَبَاتِ؟",
        "meaning": "What are the tastiest dishes prepared for occasions?"
    },
    {
        "phrase": "مَعَ الْخُبْزِ الأويغُورِيِّ، تَتَزَيَّنُ الطَّعَامَاتُ بِالْخَضَرِ.",
        "meaning": "With Uyghur bread, the dishes are adorned with vegetables."
    },
    {
        "phrase": "يُحَضِّرُ الشَّعْبُ الأويغُوريُّ الطَّعَامَ بِحُبٍّ وَاهْتِمَامٍ.",
        "meaning": "The Uyghur people prepare food with love and care."
    },
    {
        "phrase": "طَبَخَتِ أُمِّي طَعَامًا لَذِيذًا! شُكرًا لَهَا.",
        "meaning": "My mom cooked a delicious meal! Thank you to her."
    },
    {
        "phrase": "تَجَرَّبْتُ الطَّعَامَ الَّذِي قَدَّمْتِهِ، وَكَانَ شَهِيًّا جِدًّا!",
        "meaning": "I tried the food you offered, and it was very tasty!"
    },
    {
        "phrase": "مَا رَأْيُكِ فِي إِضَافَةِ بَعْضِ التَّوَابِلِ إِلَى هَذَا الطَّبَقِ؟",
        "meaning": "What do you think about adding some spices to this dish?"
    },
    {
        "phrase": "طَبَخَكِ يُشْعِرُنِي كَأَنَّني أَكُلُ مِنَ الْمَطْعَمِ.",
        "meaning": "Your cooking makes me feel like I'm eating at a restaurant."
    },
    {
        "phrase": "مَا الْوَصْفَةُ السِّرِّيَّةُ لِطَبَقِ السَّمَكِ الَّذِي طَبَخْتِهِ؟",
        "meaning": "What is the secret recipe for the fish dish you cooked?"
    },
    {
        "phrase": "تَصْمِيمُكِ لِلطَّبَقِ يُبْدِي إِبْدَاعَكِ فِي الطَّبَخِ.",
        "meaning": "Your presentation of the dish shows your creativity in cooking."
    },
    {
        "phrase": "حَقًّا، أُحِبُّ مَزَاجَ التَّوَابِلِ الْبَنْغَالِيَّةِ.",
        "meaning": "I really love the flavor of Bangladeshi spices."
    },
    {
        "phrase": "تَجَرَّبِ سَلَطَةَ الطَّمَاطِمِ مَعَ بَعْضِ التَّوَابِلِ، وَهِيَ شَهِيَّةٌ جِدًّا.",
        "meaning": "Try the tomato salad with some spices; it is very tasty."
    },
    {
        "phrase": "أَفْضَلُ وَصْفَةٍ لِتَحْضِيرِ السَّمَكِ هِيَ مَعَ التَّوَابِلِ المَحَلِّيَّةِ.",
        "meaning": "The best recipe for cooking fish is with local spices."
    },
    {
        "phrase": "مَتَى نَجْتَمِعُ لِطَبْخِ بَعْضِ الأَكْلَاتِ الْبَنْغَالِيَّةِ سَوِيًّا؟",
        "meaning": "When shall we gather to cook some Bangladeshi dishes together?"
    },
    {
        "phrase": "لِصُنْعِ الْبِرَانِيَّةِ الْبَنْغَالِيَّةِ، احْتَاجُ إِلَى رَزٍّ بَسْمَتيٍّ، وَلَحْمٍ، وَتَوَابِلٍ مَخْصُوصَةٍ.",
        "meaning": "To make Bangladeshi biryani, I need basmati rice, meat, and special spices."
    },
    {
        "phrase": "عَلَيْكِ تَجْرِبَةُ طَبَقِ الدَّجَاجِ بِالتَّوَابِلِ الْمَغْرِبِيَّةِ، سَيَكُونُ لَذِيذًا جِدًّا!",
        "meaning": "You should try the chicken dish with Moroccan spices; it will be very delicious!"
    },
    {
        "phrase": "قَالَتِ الْمَرْأَةُ الْبَنْغَالِيَّةُ أَنَّ مَزَاجَ التَّوَابِلِ يُعَزِّزُ طَعْمَ الطَّعَامِ.",
        "meaning": "The Bangladeshi woman said that the blend of spices enhances the flavor of the food."
    },
    {
        "phrase": "لِلَّذِي يُحِبُّ السَّمَك، جَرِّبْ طَبَقَ السَّمَكِ الْمُشَوَّحِ مَعَ اللَّيمُونِ وَالتَّوَابِلِ.",
        "meaning": "For those who love fish, try the grilled fish dish with lemon and spices."
    },
    {
        "phrase": "وَصْفَةُ الْخُشَافَةِ تَتَطَلَّبُ بَصَلًا وَطَمَاطِمَ وَفُصُوصَ الثُّومِ، تَجْمَعُ النَّكَهاتِ.",
        "meaning": "The recipe for khushaf requires onions, tomatoes, and garlic cloves, bringing the flavors together."
    },
    {
        "phrase": "بِالنِّسْبَةِ لِلطَّعَامِ الْهِنْدِيِّ، يُعَدُّ الدَّجَاجُ بِالزَّعَفَرَانِ وَالْكُزَبَرَةِ مِنْ أَفْضَلِ الأَطْبَاقِ.",
        "meaning": "For Indian food, chicken with saffron and coriander is one of the best dishes."
    },
    {
        "phrase": "تَتَأَلَّفُ الْمَخْلُوطَاتُ الْبَنْغَالِيَّةُ مِنَ التَّوَابِلِ الطَّازَجَةِ، مِثْلَ الْكُزَبَرَةِ وَالْفُصُوصِ.",
        "meaning": "Bangladeshi mixes consist of fresh spices, like coriander and cloves."
    },
    {
        "phrase": "جَرِّبِي تَحضِيرَ مَسَالا السَّمَكِ بَعْدَ الْغَسْلِ الجَيِّدِ وَالتَّنْقِيعِ فِي اللَّيمُونِ.",
        "meaning": "Try preparing the fish curry after washing it well and marinating it in lemon."
    },
    {
        "phrase": "تُعَدُّ الشَّعْبَةُ الْبَنْغَالِيَّةُ مِمَّا يُحَبُّ فِي كُلِّ مَنْزِلٍ، وَتَتَضَمَّنُ التَّوَابِلَ الرَّائِعَةَ.",
        "meaning": "Bengali chutney is beloved in every home, featuring wonderful spices."
    },
    {
        "phrase": "لِطَبْخِ الأَرُزِّ الْبَسْمَتِيِّ بِالْحَلَةِ، اسْتَخْدِمِي الْمَاءَ الْمُغَليَ وَمَكَانَةَ النَّقْعِ الْمُثَالِيَّةِ.",
        "meaning": "For cooking basmati rice in a pot, use boiling water and the ideal soaking method."
    }
]