[
    {
        "phrase": "مَا أَحْلَى أَنْ تَسْتَيْقِظَ فِي الصَّبَاحِ وَتَجِدُ أَنَّ حَلَّكِ يَحْتَاجُ إِلَى حَلٍّ!",
        "meaning": "How nice it is to wake up in the morning and find that your problem needs a solution!"
    },
    {
        "phrase": "إِذَا كَانَتِ الحَيَاةُ تُعْطِينَا لَمَاذَا لَا نَحْتَسِي القَهْوَةَ بِشَكْلٍ مُنَظَّمٍ؟",
        "meaning": "If life gives us lemons, why don’t we sip our coffee in an organized way?"
    },
    {
        "phrase": "عَنْدَمَا تَتَفَكَّرُ فِي الحَيَاةِ، تَجِدُ أَنَّ حَلّ السَّبَبِ فِي قَلْبِكَ.",
        "meaning": "When you think about life, you find that the solution is in your heart."
    },
    {
        "phrase": "مَا دَامَ هُنَاكَ قَهْوَةٌ، أَنَا أَشْعُرُ أَنَّ الدُّنْيَا بِخَيْرٍ.",
        "meaning": "As long as there’s coffee, I feel the world is fine."
    },
    {
        "phrase": "إِذَا كَانَ الْهَمُّ أَحْلَى مِنَ السَّعَادَةِ، لِمَاذَا نَأْكُلُ الشَّوكُولَاتَةَ؟",
        "meaning": "If worry is sweeter than happiness, why do we eat chocolate?"
    },
    {
        "phrase": "لَمَّا قَالُوا لِي: 'كُنْ صَادِقًا مَعَ نَفْسِكَ!'، أَجَبْتُ: 'حَسَنًا، أَنَا مُتَكَبِّرٌ.'",
        "meaning": "When they told me: 'Be honest with yourself!', I replied: 'Okay, I’m arrogant.'"
    },
    {
        "phrase": "مَنْ قَالَ إِنَّ العَمَلَ جَادٌّ، لَمْ يَجَرِّبْ النَّوْمَ بَعْدَ السَّحُورِ.",
        "meaning": "Whoever said work is serious has never tried sleeping after Suhoor."
    },
    {
        "phrase": "حِينَ تَحِبُّ الأَكْلَ، فَالنَّاسُ يَسْمُونَكَ طَبَّاخًا، وَإِذَا كَانَتِ النَّومُ فِي رَأْسِكَ، تَصْبِحُ مَلِكَ الْسُرُرِ.",
        "meaning": "When you love food, people call you a chef, and if sleep is on your mind, you become the king of beds."
    },
    {
        "phrase": "لَمَّا أَسْأَلُوا عَنْ أَحْوَالِي، أَقُولُ: 'أَنَا بَيْنَ كُلِّ هَذَا وَمَنْ يُدَافِعُ عَنْهُ.'",
        "meaning": "When they ask about my state, I say: 'I’m between all this and who defends it.'"
    },
    {
        "phrase": "يُقَالُ إنَّ الشَّيَاطِينَ تَحَارَبُ الأَحْلَامَ، لَكِنِّي لَمْ أَجِدْهُم في قَلْبِي.",
        "meaning": "It is said that devils fight dreams, but I couldn’t find them in my heart."
    }
]