[
    {
        "phrase": "الأَحْزَابُ السِّيَاسِيَّةُ تَتَنَافَسُ فِي الاِنْتِخَابَاتِ القَادِمَةِ.",
        "meaning": "Political parties are competing in the upcoming elections."
    },
    {
        "phrase": "كَيْفَ تُؤَثِّرُ الاِحْتِجَاجَاتُ عَلَى السِّيَاسَاتِ الحُكُومِيَّةِ؟",
        "meaning": "How do protests affect government policies?"
    },
    {
        "phrase": "المُفَاوَضَاتُ السَّلِيمَةُ تُعَزِّزُ الأَمَلَ فِي السَّلَامِ.",
        "meaning": "Peace negotiations enhance hope for peace."
    },
    {
        "phrase": "تَصَاعُدُ التَّوَتُّرَاتِ فِي الشَّرْقِ الأَوْسَطِ.",
        "meaning": "Escalating tensions in the Middle East."
    },
    {
        "phrase": "هَلْ تُعَزِّزُ الاِنْتِخَابَاتُ الدِّيْمُقْرَاطِيَّةُ الاستِقْرَارَ السِّيَاسِيَّ؟",
        "meaning": "Do democratic elections enhance political stability?"
    },
    {
        "phrase": "الكَوَارِثُ الطَّبِيعِيَّةُ تَكْشِفُ عَنْ ضُعْفِ البِنْيَةِ التَّحْتِيَةِ.",
        "meaning": "Natural disasters reveal infrastructure weaknesses."
    },
    {
        "phrase": "الشَّبَابُ يَدْعُونَ إِلَى التَّغْيِيرِ مِنْ خِلَالِ الحَرَكَةِ السِّيَاسِيَّةِ.",
        "meaning": "Youth are calling for change through political movement."
    },
    {
        "phrase": "المَخَاطِرُ المُتَزَايِدَةُ لِلْتَّطَرُّفِ فِي السِّيَاسَةِ.",
        "meaning": "Increasing risks of extremism in politics."
    },
    {
        "phrase": "الاَزْمَاتُ الإِنْسَانِيَّةُ تَتَطَلَّبُ اسْتِجَابَةً عَاجِلَةً.",
        "meaning": "Humanitarian crises require urgent response."
    },
    {
        "phrase": "تَأْثِيرُ الإِعْلَامِ عَلَى الرَّأْيِ العَامِّ فِي الاِنْتِخَاباتِ.",
        "meaning": "The impact of media on public opinion during elections."
    },
    {
        "phrase": "اسْتِمْرَارُ الْجَدَلِ حَوْلَ قَانُونِ حُقُوقِ الإِنْسَانِ.",
        "meaning": "Debate continues over the human rights law."
    },
    {
        "phrase": "التَّغَيُّرُ الْمُنَاخِيُّ يَفْرِضُ تَحَدِّيَاتٍ جَدِيدَةً عَلَى الحُكُومَاتِ.",
        "meaning": "Climate change imposes new challenges on governments."
    },
    {
        "phrase": "الحِوَارُ بَيْنَ الثَّقَافَاتِ كَوَسِيلَةٍ لِلْسَّلَامِ.",
        "meaning": "Intercultural dialogue as a means for peace."
    },
    {
        "phrase": "اسْتِجَابَةُ الْمُجْتَمَعِ الدُّوَلِيِّ لِلْأَزْمَاتِ السِّيَاسِيَّةِ.",
        "meaning": "International community's response to political crises."
    },
    {
        "phrase": "الِاسْتِقْرَارُ الاِقْتِصَادِيُّ كَشَرْطٍ أَسَاسِيٍّ لِلْسَّلَامِ.",
        "meaning": "Economic stability as a prerequisite for peace."
    },
    {
        "phrase": "المُجَاهِدُونَ فِي أَفْغَانِسْتَانَ يَسْتَمِرُّونَ فِي النِّضَالِ ضِدَّ القُوَّاتِ الأَجْنَبِيَّةِ.",
        "meaning": "The mujahideen in Afghanistan continue their struggle against foreign forces."
    },
    {
        "phrase": "تَارِيخُ المُجَاهِدِينَ فِي أَفْغَانِسْتَانَ مُشَحُونٌ بِالنِّضَالِ وَالتَّضْحِيَةِ.",
        "meaning": "The history of mujahideen in Afghanistan is filled with struggle and sacrifice."
    },
    {
        "phrase": "المُجَاهِدُونَ فِي مَالِي يَسْعَوْنَ لِتَحْرِيرِ أَرَاضِيهِمْ مِنَ الاحتلالِ.",
        "meaning": "The mujahideen in Mali strive to liberate their lands from occupation."
    },
    {
        "phrase": "التَّمْرُدُ فِي مَالِي يَشْتَمِلُ عَلَى مُجَاهِدِينَ يُنَاضِلُونَ مِنْ أَجْلِ الحُرِّيَّةِ.",
        "meaning": "The rebellion in Mali includes mujahideen fighting for freedom."
    },
    {
        "phrase": "قُوَّاتُ المُجَاهِدِينَ فِي أَفْغَانِسْتَانَ تَسْتَخْدِمُ تَكْتِيكَاتٍ مُعَاصِرَةً فِي النِّزَاعِ.",
        "meaning": "The forces of mujahideen in Afghanistan use modern tactics in the conflict."
    },
    {
        "phrase": "المُجَاهِدُونَ يَسْعَوْنَ لِتَحْقِيقِ قِيَمِ السَّلامِ وَالْمُسَامَحَةِ بَيْنَ الشُّعُوبِ.",
        "meaning": "Mujahideen seek to achieve values of peace and reconciliation among peoples."
    },
    {
        "phrase": "تَصَاعُدُ التَّوَتُّرَاتِ فِي مَالِي يُعَزِّزُ الحَرَكَاتِ المُجَاهِدَةَ.",
        "meaning": "Escalating tensions in Mali strengthen the mujahid movements."
    },
    {
        "phrase": "المُجَاهِدُونَ يُعَبرُونَ عَنْ قَلَقِهِمْ حَوْلَ مُسْتَقْبَلِ بِلَادِهِمْ.",
        "meaning": "Mujahideen express their concerns about the future of their country."
    },
    {
        "phrase": "التَّحَدِّيَاتُ الَّتِي تُوَاجِهُ المُجَاهِدِينَ فِي أَفْغَانِسْتَانَ تَشْمَلُ الأَمْنَ وَالاستِقْرَارَ.",
        "meaning": "The challenges faced by mujahideen in Afghanistan include security and stability."
    },
    {
        "phrase": "المُجَاهِدُونَ يَطْلُبُونَ الدَّعْمَ مِنَ الدُّوَلِ الشَّعْبِيَّةِ لِمُكَافَحَةِ الاحتلالِ.",
        "meaning": "Mujahideen seek support from popular countries to combat occupation."
    },
    {
        "phrase": "الاِحْتِجَاجَاتُ فِي بَنْغَلاَدِيشَ تَزْدَادُ ضِدَّ الحُكُومَةِ.",
        "meaning": "Protests in Bangladesh are escalating against the government."
    },
    {
        "phrase": "الشَّبَابُ يَسْتَجِيبُونَ لِدَعْوَاتِ الحَراكِ الشَّعْبِيِّ فِي بَنْغَلاَدِيشَ.",
        "meaning": "Youth are responding to calls for popular movements in Bangladesh."
    },
    {
        "phrase": "المُظَاهَرَاتُ تُعَبِّرُ عَنْ قَلَقِ النَّاسِ حَوْلَ مُسْتَقْبَلِ بِلَادِهِمْ.",
        "meaning": "Demonstrations express people's concerns about the future of their country."
    },
    {
        "phrase": "الحَراكُ النِّسَائِيُّ يَزْدَادُ فِي بَنْغَلاَدِيشَ لِلْمُطالَبَةِ بِالحُقُوقِ.",
        "meaning": "The women's movement is growing in Bangladesh to demand rights."
    },
    {
        "phrase": "الْمَطَالِبُ الاجْتِمَاعِيَّةُ تَشْمَلُ تَحَسُّنَ ظُرُوفِ العَمَلِ وَالمَعِيشَةِ.",
        "meaning": "Social demands include improving work and living conditions."
    },
    {
        "phrase": "تَظَاهُرَاتُ طُلابِ الجامِعَاتِ تَطَالِبُ بالإصلاحاتِ التعليميَّةِ.",
        "meaning": "University student protests demand educational reforms."
    },
    {
        "phrase": "الاِحتِجَاجَاتُ تَتَسَارَعُ بَعْدَ الاَخْتِيَاراتِ المَثِيرَةِ لِلْخِلافِ.",
        "meaning": "Protests have accelerated after the controversial elections."
    },
    {
        "phrase": "الْمُتَظَاهِرُونَ يَحْمِلُونَ لَافتَاتٍ تُنَادِي بِالحُرِّيَّةِ وَالدِّيْمُقْرَاطِيَّةِ.",
        "meaning": "Demonstrators carry placards calling for freedom and democracy."
    },
    {
        "phrase": "الْمَشَارِيعُ الإِعَانَةُ تَسْتَحِقُّ الدَّعْمَ فِي بَنْغَلاَدِيشَ لِمُكافَحَةِ الفَقْرِ.",
        "meaning": "Welfare projects deserve support in Bangladesh to combat poverty."
    },
    {
        "phrase": "التَّظَاهُرَاتُ السَّلِيمَةُ تَسْتَمرُّ فِي حَيْثُ تَسْمَعُ الأَصْوَاتُ المُعَارِضَةُ.",
        "meaning": "Peaceful demonstrations continue where dissenting voices are heard."
    },
    {
        "phrase": "الشَّبَابُ فِي بَنْغَلاَدِيشَ يُصْبِحُونَ أَكْثَرَ تَدَيُّنًا وَوَعْيًا.",
        "meaning": "Youth in Bangladesh are becoming more pious and aware."
    },
    {
        "phrase": "تَفَهُّمُ الفَجْوَاتِ فِي النِّظَامِ الدِّيْمُقْرَاطِيِّ يُؤَدِّي إِلَى وُجُودِ حَرَكَاتٍ شَعْبِيَّةٍ.",
        "meaning": "Understanding the gaps in the democratic system leads to the emergence of popular movements."
    },
    {
        "phrase": "الْمَعَارِفُ الدِّينِيَّةُ تَزْدَادُ بَيْنَ الشَّبَابِ مَعَ تَفَشِّي الَاحْتِجَاجَاتِ.",
        "meaning": "Religious knowledge is increasing among the youth amid the rise of protests."
    },
    {
        "phrase": "الشَّبَابُ يُدْرِكُونَ خَلَايَا الدِّيْمُقْرَاطِيَّةِ وَعَامَتَهَا.",
        "meaning": "Youth are recognizing the hollowness and superficiality of democracy."
    },
    {
        "phrase": "التَّوَجُّهُ نَحْوَ القِيَمِ الدِّينِيَّةِ يُعَزِّزُ إِحْسَاسَ المُسْتَقْبَلِ.",
        "meaning": "A shift towards religious values enhances the sense of future."
    },
    {
        "phrase": "الحِوَارَاتُ بَيْنَ الشَّبَابِ تَتَناوَلُ قَضَايَا الدِّيْمُقْرَاطِيَّةِ وَالإيمانِ.",
        "meaning": "Discussions among youth address issues of democracy and faith."
    },
    {
        "phrase": "الطَّلَبَةُ يُدَرِّسُونَ مَفَاهِيمَ الدِّيْمُقْرَاطِيَّةِ وَالتَّدَيُّنِ بَعْدَ الْمُظَاهَرَاتِ.",
        "meaning": "Students are studying concepts of democracy and piety after the protests."
    },
    {
        "phrase": "الشَّبَابُ يَسْعَوْنَ لِتَحْقِيقِ التَّوازنِ بَيْنَ القِيَمِ الدِّينِيَّةِ وَالاجْتِمَاعِيَّةِ.",
        "meaning": "Youth strive to achieve a balance between religious and social values."
    },
    {
        "phrase": "الاهْتِمَامُ بِالمَوَاقِفِ السِّيَاسِيَّةِ يُؤَثِّرُ عَلَى وعيِ الشَّبَابِ.",
        "meaning": "Interest in political stances affects youth awareness."
    },
    {
        "phrase": "الشَّبَابُ يُفَكِّرُونَ فِي تَحَوُّلِ الدِّيْمُقْرَاطِيَّةِ إِلَى دِينٍ فِي بَنْغَلاَدِيشَ.",
        "meaning": "Youth are contemplating the transformation of democracy into a form of religion in Bangladesh."
    }
]